YellowCollectorClient/src/Catalogs/СервераYellowCollector/СервераYellowCollector.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СервераYellowCollector</name>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

YellowCollectorClient/src/Catalogs/СервераYellowCollector/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// По умолчанию.
// 
// Возвращаемое значение:
//  СправочникСсылка.СервераYellowCollector - 
Функция ПоУмолчанию() Экспорт
	Возврат Основной;
КонецФункции

Функция Активный() Экспорт
	
	Запрос = Новый Запрос(ТекстЗапросаАктивный());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сервер;
	КонецЕсли;
	
	Возврат ПоУмолчанию();
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаАктивный() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СервераYellowCollector.Ссылка КАК Сервер
	|ИЗ
	|	Справочник.СервераYellowCollector КАК СервераYellowCollector
	|ГДЕ
	|	СервераYellowCollector.Активный";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
